In [217]:
import pandas as pd
import numpy as np

data = pd.read_csv('test.csv')

In [190]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [191]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [192]:
y = data['Survived']
data.drop('Survived', axis=1, inplace=True)

In [218]:
data.drop(['Cabin', 'PassengerId', 'Name', 'Ticket'], axis=1, inplace=True)

In [219]:
mean_age = np.mean(data['Age'])

In [220]:
data.loc[data['Age'].isnull(), 'Age'] = mean_age

In [123]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Pclass      891 non-null int64
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
dtypes: float64(2), int64(3), object(2)
memory usage: 48.8+ KB

In [221]:
data['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [222]:
nan_emb = data['Embarked'].isnull()

In [223]:
data.loc[nan_emb, 'Embarked'] = 'S'
data[nan_emb]

Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

In [167]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.6+ KB

In [127]:
data.head()

  Pclass     Sex Age SibSp Parch     Fare Embarked
0      3    male  22     1     0     7.25        S
1      1  female  38     1     0  71.2833        C
2      3  female  26     0     0    7.925        S
3      1  female  35     1     0     53.1        S
4      3    male  35     0     0     8.05        S

In [224]:
sex_ohe = pd.get_dummies(data.Sex)

In [225]:
data_s = pd.concat([data, sex_ohe], sort=False, axis=1)

In [202]:
data_s.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  female  male
0       3    male  22.0      1      0   7.2500        S       0     1
1       1  female  38.0      1      0  71.2833        C       1     0
2       3  female  26.0      0      0   7.9250        S       1     0
3       1  female  35.0      1      0  53.1000        S       1     0
4       3    male  35.0      0      0   8.0500        S       0     1

In [226]:
data_s.drop('Sex', axis=1, inplace=True)

In [227]:
embarked_ohe = pd.get_dummies(data_s.Embarked)
data_s_e = pd.concat([data_s, embarked_ohe], axis=1, sort=False)

In [228]:
data_s_e.drop('Embarked', axis=1, inplace=True)

In [241]:
mean_fare = np.mean(data['Fare'])
data_s_e.loc[data_s_e.Fare.isnull(), 'Fare'] = mean_fare

In [207]:
from sklearn.linear_model import logistic
from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import train_test_split

In [243]:
X = data_s_e.values

In [242]:
data_s_e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
Pclass    418 non-null int64
Age       418 non-null float64
SibSp     418 non-null int64
Parch     418 non-null int64
Fare      418 non-null float64
female    418 non-null uint8
male      418 non-null uint8
C         418 non-null uint8
Q         418 non-null uint8
S         418 non-null uint8
dtypes: float64(2), int64(3), uint8(5)
memory usage: 18.4 KB

In [213]:
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=12)

In [214]:
regr = logistic.LogisticRegression()

In [215]:
regr.fit(X_train, y_train)

/usr/local/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)

In [216]:
regr.score(X_test, y_test)

0.7821229050279329

In [244]:
y_pred = regr.predict(X)

In [248]:
df_pred = pd.DataFrame(y_pred, columns=['Survived'])

In [249]:
df_pred.head()

   Survived
0         0
1         0
2         0
3         0
4         1

In [250]:
data = pd.read_csv('test.csv')

In [253]:
df_pred_ = pd.concat([data.PassengerId, df_pred], axis=1)

In [254]:
df_pred_.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [261]:
df_pred_.to_csv('baseline.csv', index=False)

In [257]:
df_pred_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
PassengerId    418 non-null int64
Survived       418 non-null int64
dtypes: int64(2)
memory usage: 6.6 KB

In [259]:
test = pd.read_csv("gender_submission.csv")
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
PassengerId    418 non-null int64
Survived       418 non-null int64
dtypes: int64(2)
memory usage: 6.6 KB